//
//  TossTests.swift
//  AlgoTests
//
//  Created by Bumgeun Song on 2022/08/06.
//

import XCTest

class TossTests: XCTestCase {

    func test_dateformat_1() throws {
        let input1 = [["2022-06-24T23:57:42", "정원", "민탁님"], ["2022-06-24T23:57:44", "정원", "생일이 얼마 안남으셨네요"], ["2022-06-24T23:57:54", "정원", "소감 한말씀 부탁드립니닼ㅋㅋㅋ"], ["2022-06-24T23:58:02", "금상", "오~ 민탁님 내일 생일이세요? 축하해요!"], ["2022-06-24T23:58:05", "민탁", "으악 감사해요 이렇게 늦은저녁까지 챙겨주시고ㅠㅠ!"], ["2022-06-24T23:58:34", "도현", "민탁님 축하드려요~~!"], ["2022-06-24T23:58:36", "도현", ""], ["2022-06-24T23:58:55", "금상", "민탁님"], ["2022-06-24T23:59:01", "금상", "생일기념 내일 뭐하시나요~"], ["2022-06-24T23:59:10", "정원", "가족과 여행?"], ["2022-06-24T23:59:12", "금상", "해외여행 가시는건가요!!"], ["2022-06-24T23:59:55", "민탁", "일주일쉬면서 가족하고 하와이갑니다~~ 축하감사해요 모두!"], ["2022-06-25T00:00:01", "정원", "이제 진짜 생일되셨네요!! 축하합니다!!"], ["2022-06-25T00:01:05", "민탁", ""]]

        let answer =
        ["[정원]", "민탁님", "생일이 얼마 안남으셨네요", "소감 한말씀 부탁드립니닼ㅋㅋㅋ", "(23:57)", "[금상]", "오~ 민탁님 내일 생일이세요? 축하해요!", "(23:58)", "[민탁]", "으악 감사해요 이렇게 늦은저녁까지 챙겨주시고ㅠㅠ!", "(23:58)", "[도현]", "민탁님 축하드려요~~!", "<삭제된 메시지>", "(23:58)", "[금상]", "민탁님", "(23:58)", "[금상]", "생일기념 내일 뭐하시나요~", "(23:59)", "[정원]", "가족과 여행?", "(23:59)", "[금상]", "해외여행 가시는건가요!!", "(23:59)", "[민탁]", "일주일쉬면서 가족하고 하와이갑니다~~ 축하감사해요 모두!", "(23:59)", "-- 2022-06-25 --", "[정원]", "이제 진짜 생일되셨네요!! 축하합니다!!", "(00:00)", "[민탁]", "<삭제된 메시지>", "(00:01)"]
        
        XCTAssertEqual(solution1(input1), answer)
    }

    
    func test_횃불_1() throws {
        let input1 =
        ["FORWARD", "FORWARD", "FORWARD", "UP", "FORWARD", "FORWARD", "DOWN", "BACK", "BACK", "UP", "UP", "FORWARD", "FORWARD", "UP", "FORWARD"]
        let answer = [4,3]
        
        XCTAssertEqual(solution(input1), answer)
    }
    
    func test_플랜_1() throws {
        let input1 = ["01:00 02:00", "00:00 01:30", "01:30 02:00", "02:00 03:30", "02:30 03:00", "00:30 01:00", "01:00 01:30", "04:30 05:00"]
        let answer = 5
        
        XCTAssertEqual(solution(input1), answer)
    }
}
